tutorials/combustion/reactingSolver/volvoTestCase/0/H2O
/*---------------------------------------------------------------------------*
Caelus 6.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    triangle
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
        walls
    {
        type            zeroGradient;
    }
    cyc_half0
    {
        type            empty;
    }
    cyc_half1
    {
        type            empty;
    }
}
