tutorials/combustion/reactingSolver/volvoTestCase/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*
Caelus 6.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

h 40;
xmin -820;   // -8.8*h
xtip -34.64; // -0.866*h
xmax 680;    // 16.2*h
ymin -60;    // -1.5*h
ymax 60;
zmin -20;
zmax 20;

vertices
(
    ($xmin  $ymin $zmin)
    ($xtip  $ymin $zmin)
    (0      $ymin $zmin)
    ($xmax  $ymin $zmin)
    (0        -20 $zmin)
    ($xmax    -20 $zmin)
    ($xmin      0 $zmin)
    ($xtip      0 $zmin) 
    (0         20 $zmin)
    ($xmax     20 $zmin) 
    ($xmin  $ymax $zmin)
    ($xtip  $ymax $zmin)
    (0      $ymax $zmin)
    ($xmax  $ymax $zmin)
    ($xmin  $ymin $zmax)
    ($xtip  $ymin $zmax)
    (0      $ymin $zmax)
    ($xmax  $ymin $zmax)
    (0        -20 $zmax)
    ($xmax    -20 $zmax)
    ($xmin      0 $zmax)
    ($xtip      0 $zmax) 
    (0         20 $zmax)
    ($xmax     20 $zmax) 
    ($xmin  $ymax $zmax)
    ($xtip  $ymax $zmax)
    (0      $ymax $zmax)
    ($xmax  $ymax $zmax)  
);

blocks
(
    hex (0 1 7 6 14 15 21 20)    (80  36 1) simpleGrading (0.1 1 1) //0
    hex (1 2 4 7 15 16 18 21)    (20  36 1) simpleGrading (0.5 1 1) //I
    hex (2 3 5 4 16 17 19 18)    (220 36 1) simpleGrading (5 1 1) //II
    hex (4 5 9 8 18 19 23 22)    (220 36 1) simpleGrading (5 1 1) //III
    hex (6 7 11 10 20 21 25 24)  (80  36 1) simpleGrading (0.1 1 1) //IV
    hex (7 8 12 11 21 22 26 25)  (20  36 1) simpleGrading (0.5 1 1) //V
    hex (8 9 13 12 22 23 27 26)  (220 36 1) simpleGrading (5 1 1) //VI
);

edges
(
);

boundary
(
	triangle
	{
		type wall;
		faces
		(
		    (7 8 22 21)
		    (8 4 18 22)
		    (7 4 18 21)
		);
	}
	
	inlet
	{
		type patch;
		faces
		(
		    (0 14 20 6)
		    (6 20 24 10)
		);
	}
	
	outlet
	{
		type patch;
		faces
		(
		    (3 17 19 5)
		    (5 19 23 9)
		    (9 23 27 13)
		);
	}
	
	walls
	{
		type wall;
		faces
		(
		    (0 1 15 14) // bot
		    (1 2 16 15)
		    (2 3 17 16)
		    (10 11 25 24) // top
		    (11 12 26 25)
		    (12 13 27 26)
		);
	}
	
	//periodic-zmin
        cyc_half0
	{
		type empty;
                //neighbourPatch cyc_half1;
		faces
		(
		    (0 1 7 6)
		    (1 2 4 7)
		    (2 3 5 4)
		    (4 5 9 8)
		    (6 7 11 10)
		    (7 8 12 11)
		    (8 9 13 12)
		);
	}
	
	//periodic-zmax
        cyc_half1
	{
		type empty;
                //neighbourPatch cyc_half0;
		faces
		(
		    (14 15 21 20)
		    (15 16 18 21)
		    (16 17 19 18)
		    (18 19 23 22)
		    (20 21 25 24)
		    (21 22 26 25)
		    (22 23 27 26)
		);
	}

);

mergePatchPairs
(
);

// ************************************************************************* //
