tutorials/combustion/reactingSolver/volvoTestCase/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*
Caelus 6.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    triangle
    {
        type            wall;
        nFaces          76;
        startFace       61472;
    }
    inlet
    {
        type            patch;
        nFaces          72;
        startFace       61548;
    }
    outlet
    {
        type            patch;
        nFaces          108;
        startFace       61620;
    }
    walls
    {
        type            wall;
        nFaces          640;
        startFace       61728;
    }
    cyc_half0
    {
        type            empty;
        nFaces          30960;
        startFace       62368;
    }
    cyc_half1
    {
        type            empty;
        nFaces          30960;
        startFace       93328;
    }
)

// ************************************************************************* //
