tutorials/combustion/reactingSolver/volvoTestCase/constant/thermophysicalProperties
/*---------------------------------------------------------------------------*
Caelus 6.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType hsPsiMixtureThermo<reactingMixture<gasThermoPhysics>>;

inertSpecie N2;

// Caelus format option

chemistryReader caelusChemistryReader;
caelusChemistryFile "$CAELUS_CASE/constant/reactions";
caelusChemistryThermoFile "$CAELUS_CASE/constant/thermo.compressibleGas";



// ************************************************************************* //
