tutorials/combustion/reactingSolver/volvoTestCase/system/fvSchemes
/*---------------------------------------------------------------------------*
Caelus 6.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                       Euler; 
}

gradSchemes
{
    default                       Gauss skewCorrected linear;
}

divSchemes
{
    default                       none;
    div(phi,U)                    Gauss skewCorrected linearBJ;
    div(phi,k)                    Gauss skewCorrected linearBJ;
    div(phi,K)                    Gauss skewCorrected linearBJ;
    div(phiHat,p)                 Gauss skewCorrected linearBJ;
    div((muEff*dev2(T(grad(U))))) Gauss skewCorrected linear;
    div(((muEff*grad(U))&U))      Gauss skewCorrected linear;
    div(((muEff*dev2(T(grad(U))))&U)) Gauss skewCorrected linear;
    div(phi,Yi_h)                 Gauss linearBJ;
    div(phi,Ek)                   Gauss skewCorrected linearBJ;
}

laplacianSchemes
{
    default                        Gauss skewCorrected linear corrected;
}

interpolationSchemes
{
    default         skewCorrected linear;
    interpolate(U)  skewCorrected linear;
    reconstructField skewCorrected linearBJ;
}

snGradSchemes
{
    default         skewCorrected corrected;  // uncorrected in laminarFlame1D
}

fluxRequired
{
    default         no;
    p               ;
}


// ************************************************************************* //
