tutorials/combustion/reactingSolver/volvoTestCase/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 6.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-06;
        relTol          0;
    }

    p
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       0;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-09;
        relTol          0.01;
    }


    "(U|hs|k)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       0;
        relTol          0.1;
    }

    "(U|hs|k)Final"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0.1;
    }

    Yi
    {
        $hsFinal;
    }

}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2; // usually 2, no more than 4
    nNonOrthogonalCorrectors 0;
    rhoMin            rhoMin [ 1 -3 0 0 0 ] 0.0001;
    rhoMax            rhoMax [ 1 -3 0 0 0 ] 1000.0;
    transonic         yes;
}

// ************************************************************************* //
